DataProcessors/ВыгрузкаВНБКИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаВНБКИ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиВыгрузкиНБКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейУспешнойПередачиНБКИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЖурналу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВыгрузкаВНБКИ/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыгрузитьДанныеНаСервере(РучнаяЗагрузка)
	Если Объект.Объекты.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного объекта для выгрузки! Операция отменена.");
		Возврат;
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Объект.НастройкаВыгрузки) Тогда
		Сообщить("Выберете настройку выгрузки!");
		Возврат;
	КонецЕсли;	
	НомерСтроки = 0;
	ОбъектыОдногоТипа = ПроверитьТипыОбъектовВыгрузки(НомерСтроки);
	Если НЕ ОбъектыОдногоТипа Тогда
		Сообщить("Объект в строке "+ НомерСтроки+" не соответствует типу, заданному в настройке в поле На примере документа. Операция отменена.");
		Возврат;
	КонецЕсли;	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыгрузитьДанныеВФайл(РучнаяЗагрузка);
	Сообщить("Файл выгрузки сформирован!");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	РучнаяЗагрузка = Истина;
	ВыгрузитьДанныеНаСервере(РучнаяЗагрузка);
КонецПроцедуры

&НаСервере
Функция ПроверитьТипыОбъектовВыгрузки(НомерСтроки)
	ОдинТип = Истина;
	ТипОбъектаНастройка = ТипЗнч(Объект.НастройкаВыгрузки.НаПримереДокумента);
	Для каждого Стр Из Объект.Объекты Цикл
		Если ТипОбъектаНастройка <> ТипЗнч(Стр.Объект) Тогда
			НомерСтроки = Стр.НомерСтроки;
			ОдинТип = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ОдинТип; 
			
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	ОбъектыКлиент.Подбор(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзФайла(Команда)
	ОбъектыКлиент.ПодборИзДОК(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПерезаписатьДатуНаСервере()
	Если Не ЗначениеЗаполнено(Объект.НастройкаВыгрузки) Тогда
		Сообщить("Выберете настройку выгрузки!");
		Возврат;
	КонецЕсли;	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаписатьДатуПередачи(ПолеИсходнойТаблицы,Объект.НастройкаВыгрузки,ТекстФайлаОшибок,Объект.ПоЖурналу);
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПерезаписатьДату(Команда)
	ПерезаписатьДатуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьНомераСтолбцов();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Объект.ПоЖурналу = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиДляОбъектовНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьРСНастройкиВыгрузки();
	Сообщить("Настройки определены для объектов учета!");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНастройкиДляОбъектов(Команда)
	ЗаполнитьНастройкиДляОбъектовНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПодборПоНастройкам(Команда)
	//ОбъектыКлиент.ПодборПоНастройкам(ЭтаФорма);
	ФормаПодбор = ПолучитьФорму("Обработка.ПодборДО.Форма.Форма",, ЭтаФорма); 
	ФормаПодбор.Объект.ТипИсточника = Неопределено;
	//Чуров
	ОткрытьФорму(ФормаПодбор)
КонецПроцедуры
